# Reto 8

In [1]:
# Se importa un objeto sqlite3 y pandas
import sqlite3
import pandas as pd

In [2]:
# Nos conectamos a la base de datos
connection = sqlite3.connect('books.db')

In [3]:
# Consulta de los autores
pd.read_sql('SELECT * FROM authors', connection,
            index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [4]:
# Consulta de los libros
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0132151006     Internet & WWW How to Program        5      2012
1  0134743350               Java How to Program       11      2018
2  0133976890                  C How to Program        8      2016
3  0133406954  Visual Basic 2012 How to Program        6      2014
4  0134601548          Visual C# How to Program        6      2017
5  0136151574         Visual C++ How to Program        2      2008
6  0134448235                C++ How to Program       10      2017
7  0134444302            Android How to Program        3      2017
8  0134289366         Android 6 for Programmers        3      2016

In [5]:
# Se consultan las columnas first y last
pd.read_sql('SELECT first, last FROM authors', connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

# Reto 9

In [6]:
# El objeto cursor permite modificar la BD
cursor = connection.cursor()

In [7]:
# Se añade valores a la BD
cursor = cursor.execute("""INSERT INTO authors (first, last)
                            VALUES ('Sue', 'Red')""")

In [9]:
# Se muestran los valores de la BD
pd.read_sql('SELECT id, first, last FROM authors', 
             connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

In [10]:
# Se eliminan valores a la BD
cursor = cursor.execute('DELETE FROM authors WHERE id=1')

In [11]:
# Se muestran los valores de la BD
pd.read_sql('SELECT id, first, last FROM authors', 
             connection, index_col=['id'])

        first    last
id
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red